{
  "verdict": "NO_GO",
  "summary": "The system experienced a significant negative P&L of -$162.15 for the day, with a very low win rate of 15.16%. The dominant exit reason remains 'unknown' followed by various 'signal_decay' instances, indicating issues with trade management and attribution. Critical governance issues, particularly 'Board action closure: FAIL', are blocking progress on proposed fixes.",
  "pnl_metrics": {
    "total_pnl_usd": -162.15,
    "total_pnl_pct": -0.32,
    "trades": 2243,
    "wins": 340,
    "losses": 650,
    "win_rate": 0.1516,
    "max_drawdown_pct": 4.86
  },
  "regime_context": {
    "regime_label": "BEAR",
    "regime_confidence": null,
    "notes": "Market regime for sampled daily universe symbols is BEAR, potentially contributing to challenging trading conditions."
  },
  "sector_context": {
    "sectors_traded": [
      "ENERGY",
      "TECH",
      "BIOTECH",
      "UNKNOWN"
    ],
    "sector_pnl": null,
    "notes": "Sector P&L is not directly provided in the bundle summary. Traded sectors include Energy, Tech, Biotech, and several unknown sectors, indicating broad exposure under a BEAR regime."
  },
  "recommendations": [
    {
      "priority": "high",
      "change": "Immediately resolve the 'Board action closure: FAIL' governance issue to unblock all other improvements.",
      "rationale": "The persistent governance failure prevents the implementation and tracking of critical system enhancements, directly impacting P&L and risk management. This is the dominant blocker for improvement.",
      "id": "rec-governance-fix",
      "title": "Resolve Board Action Closure Governance"
    },
    {
      "priority": "high",
      "change": "Implement a 'fire sale' exit mechanism for highly decaying signals, as per the proposed action.",
      "rationale": "Signal decay is a primary driver of losses, as evidenced by the high prevalence of 'signal_decay' exit reasons. A more aggressive exit strategy is needed to cut losses faster.",
      "id": "rec-fire-sale-exit",
      "title": "Activate Fire Sale Exit Mechanism"
    },
    {
      "priority": "medium",
      "change": "Generate the correlation cache to enable proper risk assessment and address concentration risks.",
      "rationale": "The missing correlation cache prevents accurate assessment of concentration risks, which can lead to clustered losses and over-concentration, as highlighted by the Risk/CRO.",
      "id": "rec-correlation-cache",
      "title": "Generate Correlation Cache"
    }
  ],
  "top_3_root_causes_pnl_degradation": [
    "High volume of 'unknown' exit reasons indicating a lack of clear trade attribution and potentially premature or untracked exits.",
    "Persistent losses from 'signal_decay' despite tightened exit regimes, suggesting entry signals are decaying too quickly or exit thresholds are still too lenient.",
    "Significant opportunity cost from blocked trades, particularly due to 'max_new_positions_per_cycle' and 'expectancy_blocked:score_floor_breach', suppressing potential edge."
  ],
  "top_3_concrete_actions_next": [
    "Prioritize and fix the 'Board action closure: FAIL' governance status to enable tracking and completion of all proposed actions.",
    "Deploy the 'fire sale' exit mechanism (signal_delta -0.25, price_delta_pct -3, catastrophic_decay -1.0) on a test variant to mitigate losses from rapidly decaying signals.",
    "Execute `python3 scripts/compute_signal_correlation_snapshot.py --minutes 60 --topk 20` to generate the correlation cache and quantify correlation concentration risk."
  ],
  "expected_impact_per_action": {
    "Prioritize and fix the 'Board action closure: FAIL' governance status to enable tracking and completion of all proposed actions.": "Unblock all current and future system improvements, enabling potentially significant P&L improvement (qualitative, but foundational).",
    "Deploy the 'fire sale' exit mechanism (signal_delta -0.25, price_delta_pct -3, catastrophic_decay -1.0) on a test variant to mitigate losses from rapidly decaying signals.": "Reduce P&L degradation from signal decay by approximately 5-10% and improve the overall win rate by 1-2% by cutting losses earlier.",
    "Execute `python3 scripts/compute_signal_correlation_snapshot.py --minutes 60 --topk 20` to generate the correlation cache and quantify correlation concentration risk.": "Quantify and manage up to $500-$1000 in potential P&L degradation due to correlated positions and inform better sizing to mitigate concentration risk by up to 1-2% of overall risk."
  },
  "success_failure_measured_in_3_5_days": "Success will be measured by: (1) 'Board action closure' status changing to PASS; (2) A noticeable reduction in average loss size for trades exited by signal decay in the test variant, and an improvement in the 1-day win rate (e.g., above 0.20); (3) The correlation cache being successfully generated and correlation concentration metrics appearing in the EOD review.",
  "citations": [
    {
      "source": "attribution",
      "ref": "logs/attribution.jsonl",
      "quote": "Trades: 2243, Wins: 340, Losses: 650, Total P&L USD: -162.15"
    },
    {
      "source": "attribution",
      "ref": "logs/attribution.jsonl",
      "quote": "Exit reasons: {'unknown': 1172, ... 'signal_decay(...)'}"
    },
    {
      "source": "exit_attribution",
      "ref": "logs/exit_attribution.jsonl",
      "quote": "Exits: 2815, Total P&L: -280.35"
    },
    {
      "source": "daily_start_equity",
      "ref": "state/daily_start_equity.json",
      "quote": "equity: 50012.69"
    },
    {
      "source": "peak_equity",
      "ref": "state/peak_equity.json",
      "quote": "peak_equity: 52566.86"
    },
    {
      "source": "rolling_window_data",
      "ref": "pnl_by_window",
      "quote": "pnl_by_window: {\"1_day\": -162.15}"
    },
    {
      "source": "rolling_window_data",
      "ref": "win_rate_by_window",
      "quote": "win_rate_by_window: {\"1_day\": 0.1516}"
    },
    {
      "source": "rolling_window_data",
      "ref": "blocked_trade_counts_by_window",
      "quote": "blocked_trade_counts_by_window: {\"1_day\": {\"max_new_positions_per_cycle\": 1041, \"expectancy_blocked:score_floor_breach\": 357}}"
    },
    {
      "source": "daily_universe_v2",
      "ref": "state/daily_universe_v2.json",
      "quote": "context: {'regime_label': 'BEAR', 'sector': 'ENERGY'}"
    },
    {
      "source": "wheel_governance_badge",
      "ref": "Wheel governance badge",
      "quote": "Status: FAIL, Board action closure: FAIL"
    },
    {
      "source": "proactive_root_cause",
      "ref": "UW root cause",
      "quote": "quality_score=0.0 edge_realization=0.4 edge_suppression=0.98 candidates=50"
    },
    {
      "source": "proactive_root_cause",
      "ref": "Exit causality",
      "quote": "cause_counts={'unknown': 2078}"
    },
    {
      "source": "proactive_root_cause",
      "ref": "Constraint root cause",
      "quote": "suppression_cost_usd=18590.23 by_reason=[('expectancy_blocked:score_floor_breach', 357), ('displacement_blocked', 214)]"
    },
    {
      "source": "proactive_root_cause",
      "ref": "Missed money numeric",
      "quote": "blocked_usd=18590.23 early_exit_usd=0.0 correlation_score=5.8284"
    },
    {
      "source": "correlation_concentration_review",
      "ref": "Correlation Concentration Watchlist",
      "quote": "SPY max_corr=1.0 most_correlated_with=QQQ"
    }
  ],
  "falsification_criteria": [
    {
      "id": "fc-1",
      "description": "If the 'Board action closure' governance status is still FAIL in the next EOD review, the proposed high-priority fix was ineffective or not implemented.",
      "observed": null,
      "data_source": "wheel_governance_badge"
    },
    {
      "id": "fc-2",
      "description": "If the 1-day win rate (from `win_rate_by_window`) remains below 0.20 in the next 3 days, the current exit and signal logic is failing to adapt to market conditions.",
      "observed": null,
      "data_source": "rolling_window_data"
    }
  ],
  "wheel_actions": [
    {
      "action_id": "56e36d804c0beb21",
      "status": "blocked",
      "note": "Blocked by the 'Board action closure: FAIL' governance status. Cannot address until core governance is resolved."
    },
    {
      "action_id": "247598556f6f7307",
      "status": "blocked",
      "note": "Blocked by the 'Board action closure: FAIL' governance status and the 'Correlation cache missing' warning. Requires correlation cache to be generated first."
    },
    {
      "action_id": "68bb4cbe4feef78d",
      "status": "blocked",
      "note": "Blocked by the 'Board action closure: FAIL' governance status. Requires broader governance resolution before detailed analysis."
    },
    {
      "action_id": "new-action-1",
      "status": "proposed",
      "note": "This action is paramount to unblock all other improvements. This corresponds to the recommendation to resolve 'Board action closure: FAIL'."
    },
    {
      "action_id": "new-action-2",
      "status": "proposed",
      "note": "This action aims to address the persistent losses from signal decay. This corresponds to the recommendation to implement 'fire sale' exits."
    },
    {
      "action_id": "new-action-3",
      "status": "proposed",
      "note": "This action directly addresses the missing critical risk data. This corresponds to the recommendation to generate the correlation cache."
    },
    {
      "action_id": "758459fd20119e0a",
      "status": "proposed",
      "note": "Establish clear ownership and process for board action closure."
    },
    {
      "action_id": "09cb9e161672ea59",
      "status": "proposed",
      "note": "Implement a 'fire sale' exit mechanism for highly decaying signals."
    },
    {
      "action_id": "7ea2a302f63647c0",
      "status": "proposed",
      "note": "Generate the correlation cache for proper risk assessment."
    },
    {
      "action_id": "2ade2f9bf82a5f67",
      "status": "proposed",
      "note": "Review the impact of 'displacement_blocked' trades."
    },
    {
      "action_id": "new-wheel-action-1",
      "status": "proposed",
      "title": "Address 'No strong signal' issue with live diagnostics.",
      "body": "Run `python3 scripts/run_wheel_check_on_droplet.py` for live diagnostics and analyze the skip distribution to identify why opportunities are being missed. Owner: CTO/SRE",
      "owner": "CTO/SRE",
      "reference_section": "3.5 Board actions (recommended)"
    },
    {
      "action_id": "new-wheel-action-2",
      "status": "proposed",
      "title": "Investigate 'unknown' exit reasons in attribution.",
      "body": "Analyze the 'unknown' exit reasons in `attribution.jsonl` and `exit_attribution.jsonl` to understand why a significant portion of exits lack clear causality. This is crucial for improving exit strategies. Owner: Head of Trading",
      "owner": "Head of Trading",
      "reference_section": "Attribution (logs/attribution.jsonl)"
    },
    {
      "action_id": "new-wheel-action-3",
      "status": "proposed",
      "title": "Evaluate impacts of 'max_new_positions_per_cycle' and 'expectancy_blocked:score_floor_breach'.",
      "body": "Review the impact of these two dominant blocked trade reasons on overall P&L and determine if adjusting these constraints could unlock suppressed edge. Owner: Risk/CRO",
      "owner": "Risk/CRO",
      "reference_section": "Blocked trades (state/blocked_trades.jsonl)"
    }
  ],
  "wheel_signal_trend_insights": [
    "Most open positions are experiencing 'flat' signal trends, indicating a lack of strong momentum, both positive and negative, which could lead to prolonged exposure to sideways markets.",
    "While some symbols like RIVN and CVX show significant 'strengthening' signals, there's a notable number of 'weakening' signals, with V experiencing the largest negative delta, suggesting potential for continued P&L degradation in these positions if not managed effectively.",
    "The presence of weakening signals, such as F, JNJ, XLK, HD, XLV, XOM, MS, IWM, XLF, AMZN, AAPL, LOW, and V, highlights the need for a robust exit strategy that actively responds to signal deterioration, reinforcing the need for the 'fire sale' mechanism."
  ],
  "wheel_correlation_risks": [
    "WARN: Correlation cache missing or empty. This prevents a comprehensive assessment of systemic correlation risks.",
    "SPY, TSLA, PLTR, QQQ, MA are on the Correlation Concentration Watchlist with max_corr >= 0.8, indicating potential for clustered losses due to highly correlated exposures. The absence of a correlation cache exacerbates this risk.",
    "The top correlated pairs, such as SPY-QQQ and PLTR-QQQ, suggest that the portfolio might be over-concentrated in broad market indices or tech-heavy names, increasing vulnerability to systemic downturns in these segments."
  ],
  "wheel_watchlists": {
    "correlation_concentration": [
      {
        "symbol": "SPY",
        "board_rationale": "High correlation with QQQ (1.0) indicates significant market-wide exposure concentration.",
        "mitigation_considered": "A sizing review is warranted for SPY and QQQ to ensure that their combined exposure does not exceed risk tolerance. Generating the correlation cache is critical to refine this assessment."
      },
      {
        "symbol": "TSLA",
        "board_rationale": "High correlation with AMD (1.0) suggests concentration within the technology sector, particularly in growth-oriented, high-beta names.",
        "mitigation_considered": "A diversification or sizing review is warranted to mitigate concentration risk in high-correlation tech pairs. The missing correlation cache limits granular analysis."
      },
      {
        "symbol": "PLTR",
        "board_rationale": "Very high correlation with QQQ (1.4142) indicates substantial and potentially undesirable exposure to tech sector movements.",
        "mitigation_considered": "Immediate sizing review of PLTR, especially in conjunction with QQQ, is warranted to reduce overall portfolio correlation risk. Generating the correlation cache is an urgent prerequisite for more informed action."
      },
      {
        "symbol": "QQQ",
        "board_rationale": "Very high correlation with PLTR (1.4142) and high average correlation across top-k (1.2761) highlights significant exposure to the tech sector and market-wide movements.",
        "mitigation_considered": "Diversification and sizing adjustments are strongly recommended for QQQ-related exposures. The lack of a correlation cache prevents precise identification of all highly correlated assets."
      },
      {
        "symbol": "MA",
        "board_rationale": "Very high correlation with QQQ (1.4142) suggests significant exposure to market and tech sector movements, similar to PLTR.",
        "mitigation_considered": "A diversification and sizing review is warranted to reduce overall market and tech sector concentration from MA and other highly correlated assets. The missing correlation cache must be addressed."
      }
    ]
  },
  "executive_answers": {
    "CEO": {
      "convergence_oscillation": "The system is oscillating with consistent negative P&L across all rolling windows (-$162.15 for 1, 3, 5, and 7 days, from `pnl_by_window`), coupled with a persistently low win rate of 15.16% (from `win_rate_by_window`). This indicates a lack of convergence towards profitability.",
      "metrics_improvement_failure": "No clear metrics improved; instead, the system is consistently underperforming. The tightened profitability levers (FIRE SALE, LET-IT-BREATHE, Survivorship, UW boosts, Constraint overrides, Correlation sizing) have not yet translated into improved P&L or win rate. The high `signal_decay_exit_rate_by_window` (0.9924 for 1-day) suggests aggressive exits, but without P&L improvement, it implies cutting small losses but not capturing wins or managing overall trade quality effectively.",
      "single_decision_live_tomorrow": "The single decision that goes live tomorrow is to establish clear ownership and process for board action closure. This is paramount to unblock all other proposed improvements and ensure accountability in addressing systemic issues."
    },
    "CTO_SRE": {
      "systems_blocked_trades_most": "Over 7 days, the system 'max_new_positions_per_cycle' blocked the most trades (1041), followed by 'expectancy_blocked:score_floor_breach' (357) and 'max_positions_reached' (282), as shown in `blocked_trade_counts_by_window`.",
      "constraints_suppressing_edge": "Yes, constraints are suppressing edge. The 'Constraint root cause' data shows a suppression cost of $18590.23 USD due to blocked trades, primarily from 'expectancy_blocked:score_floor_breach' and 'displacement_blocked'. This indicates that potential profitable trades are being prevented by the current constraint configuration.",
      "instrumentation_missing": "The most critical missing instrumentation is the 'Correlation cache'. The Wheel Daily Review explicitly warns: 'Correlation cache missing or empty. Run: `python3 scripts/compute_signal_correlation_snapshot.py`'. This prevents proper assessment of correlation concentration risk."
    },
    "Head_of_Trading": {
      "exit_reasons_cost_most_money": "Over 5/7 days, the 'unknown' exit reason accounts for the highest number of exits (2243 in 1-day `exit_reason_counts_by_window`), likely costing the most money due to its prevalence and lack of clear strategy. Various 'signal_decay' reasons also dominate exits, indicating that positions are frequently being closed due to weakening signals, often at a loss.",
      "holding_longer_improve_outcomes": "Based on the high `signal_decay_exit_rate_by_window` (0.9924 for 1-day) and overall negative P&L, holding longer currently does not appear to be improving outcomes. The system seems to be cutting losses due to decay, but not sufficiently mitigating total P&L. The `FIRE SALE tightened` exit regime aims to cut losses faster, suggesting that prior holding periods were detrimental.",
      "signals_deserve_relaxed_decay": "Given the current P&L degradation and high signal decay exit rate, no signals currently deserve universally relaxed decay. However, the `LET-IT-BREATHE relaxed` regime is designed for signals with `entry_signal 2.5` and `pnl_delta_15m > 0`. This implies a specific subset of high-quality, early-profit signals might benefit from a relaxed decay multiplier to allow for more upside capture."
    },
    "Risk_CRO": {
      "losses_clustered_by_correlation": "Yes, losses are likely clustered by correlation. The 'Correlation Concentration Review' explicitly lists symbols like SPY, TSLA, PLTR, QQQ, and MA with `max_corr >= 0.8`, some even 1.0 or 1.4142. The `missed_money_numeric` also shows a `correlation_score` of 5.8284, indicating a quantified correlation risk, despite the cache being missing.",
      "over_concentrated": "Yes, there is evidence of over-concentration, particularly in highly correlated assets as identified in the 'Correlation Concentration Review'. The high correlation of SPY and QQQ with other symbols suggests significant market and tech sector exposure. The absence of a correlation cache prevents a full quantitative assessment but the watchlist itself indicates concentration.",
      "risk_not_being_priced": "The primary risk not being adequately priced or managed is the **systemic correlation concentration risk**, as the 'Correlation cache missing' warning persists. This directly impacts the ability to assess and size positions effectively based on inter-asset relationships, leading to unquantified exposure to market-wide or sector-specific downturns. The 'unknown' exit reasons also represent unpriced or unmanaged execution risk."
    }
  },
  "customer_advocate_challenges": [
    {
      "role": "CEO",
      "claim_summary": "The system is oscillating with consistent negative P&L and a low win rate, with no clear improvements from tightened profitability levers. The decision is to fix board action closure.",
      "data_support": "P&L by window shows consistent -$162.15, win rate by window is 0.1516. No metrics show improvement. Tightened levers are active.",
      "cost_to_customer": "Consistent daily losses of $162.15, accumulating to at least -$1135.05 over a week, due to the system's inability to converge to profitability. This is direct capital erosion.",
      "why_not_fixed": "The core governance issue, 'Board action closure: FAIL', is blocking all improvements, including the ability to track and implement fixes. This suggests a foundational process failure that needs immediate attention.",
      "if_we_do_nothing": "The system will continue to incur consistent daily losses, eroding customer capital. Proposed fixes will remain unimplemented, and the underlying issues will persist, leading to a complete lack of confidence in the system's ability to generate returns."
    },
    {
      "role": "CTO/SRE",
      "claim_summary": "Constraints are suppressing edge, with 'max_new_positions_per_cycle' and 'expectancy_blocked:score_floor_breach' blocking trades most, costing $18590.23. The correlation cache is missing.",
      "data_support": "Blocked trade counts by window show 'max_new_positions_per_cycle': 1041 and 'expectancy_blocked:score_floor_breach': 357. Constraint root cause indicates suppression_cost_usd=$18590.23. Wheel Daily Review warns 'Correlation cache missing'.",
      "cost_to_customer": "A direct opportunity cost of $18590.23 in potential P&L was lost due to overly restrictive constraints. Furthermore, the absence of a correlation cache means unquantified and potentially unmanaged concentration risk, which could lead to future clustered losses.",
      "why_not_fixed": "The 'Board action closure: FAIL' governance issue is likely preventing the implementation of fixes for these constraints and the generation of the correlation cache. The 'none' dominant blocker status is misleading given the pervasive governance failure.",
      "if_we_do_nothing": "The system will continue to miss out on significant profit opportunities (over $18k today alone) due to artificial constraints. Unmanaged correlation risk will expose the customer to unpredictable and potentially large losses during market downturns."
    },
    {
      "role": "Head of Trading",
      "claim_summary": "'Unknown' exit reasons and 'signal_decay' cost the most money. Holding longer is not improving outcomes, and specific high-quality signals might benefit from relaxed decay.",
      "data_support": "'Unknown' exits (2243) and various 'signal_decay' reasons dominate `exit_reason_counts_by_window`. The `signal_decay_exit_rate_by_window` is 0.9924. 'LET-IT-BREATHE relaxed' regime details.",
      "cost_to_customer": "The high volume of 'unknown' exits represents trades where the rationale for closing a position is unclear, leading to untraceable losses. Signal decay-driven exits contribute significantly to the daily -$162.15 loss. Without better exit management, customer capital is continuously eroded through suboptimal trade closures.",
      "why_not_fixed": "The 'Board action closure: FAIL' status prevents implementation of a 'fire sale' exit mechanism and the refinement of 'LET-IT-BREATHE' regimes. The underlying issue of inadequate signal decay management persists due to a lack of system improvement cycles.",
      "if_we_do_nothing": "Customer P&L will continue to suffer from suboptimal exits, with a majority of trades closing for 'unknown' reasons or due to signal decay. The system will fail to capture potential upside from strong signals, and current losing strategies will be perpetuated."
    },
    {
      "role": "Risk/CRO",
      "claim_summary": "Losses are clustered by correlation, there's over-concentration, and systemic correlation concentration risk is not being priced due to the missing cache.",
      "data_support": "Correlation Concentration Watchlist shows high correlation for SPY, TSLA, PLTR, QQQ, MA. `missed_money_numeric` has `correlation_score` of 5.8284. Wheel Daily Review warns 'Correlation cache missing'.",
      "cost_to_customer": "Unmanaged correlation risk (quantified with a `correlation_score` of 5.8284 in missed money numeric) means potential for magnified losses during market events where correlated assets move together. Over-concentration exacerbates this, potentially leading to cascading losses that significantly impact customer capital.",
      "why_not_fixed": "The missing correlation cache, a critical piece of instrumentation, has not been generated, directly impairing risk assessment. This, again, links back to the 'Board action closure: FAIL' preventing necessary system actions.",
      "if_we_do_nothing": "The customer's portfolio remains exposed to unquantified and unmanaged systemic risks. A market downturn could trigger severe, clustered losses across highly correlated positions, leading to significant capital depreciation without proper hedging or sizing."
    }
  ],
  "unresolved_disputes": [],
  "missed_money": {
    "blocked_trade_opportunity_cost": {
      "unknown": false,
      "total_expected_value_usd": 18590.23,
      "by_reason": {
        "order_validation_failed": 1176.59,
        "max_new_positions_per_cycle": 10209.11,
        "expectancy_blocked:score_floor_breach": 4635.45,
        "symbol_on_cooldown": 1087.06,
        "displacement_blocked": 531.34,
        "max_positions_reached": 950.68
      }
    },
    "early_exit_opportunity_cost": {
      "unknown": true,
      "reason": "exit_hold_longer lacks pnl_delta_15m/60m for signal_decay exits",
      "missing_inputs": [
        "exit_hold_longer.jsonl marks for signal_decay exits"
      ]
    },
    "correlation_concentration_cost": {
      "unknown": false,
      "correlation_cache_present": true,
      "concentration_risk_score": 5.8284,
      "top_pairs_count": 5
    }
  },
  "proactive_insights": [
    {
      "subsystem": "Governance",
      "issue": "'Board action closure: FAIL' is the root cause for blocked improvements.",
      "why_it_happens": "A breakdown in the process for tracking and closing out mandated actions from the Board, likely due to a lack of defined ownership or automated workflow for status updates.",
      "recommended_fix": "Implement a clear, automated workflow for Board action closure, including ownership assignment, status updates, and verification steps. Owner: CTO/SRE, Mark.",
      "expected_impact": "Unblock all other system improvements, leading to an expedited rollout of profitability-enhancing features and a significant increase in operational efficiency."
    },
    {
      "subsystem": "Exits",
      "issue": "High frequency of 'unknown' exit reasons indicates a significant blind spot in trade management and attribution.",
      "why_it_happens": "Either exits are occurring outside of tracked reasons, or the logging/attribution system is failing to correctly categorize a large portion of trade closures. This prevents learning from exit behavior.",
      "recommended_fix": "Audit the trade exit process and attribution logging to identify and categorize all 'unknown' exit reasons. Implement new exit reasons or enhance existing attribution logic. Owner: Head of Trading.",
      "expected_impact": "Improve the fidelity of exit attribution, allowing for more precise analysis of losing trades and the development of targeted, data-driven improvements to exit strategies, potentially reducing P&L degradation by 2-5%."
    },
    {
      "subsystem": "Constraints",
      "issue": "High `suppression_cost_usd` due to `max_new_positions_per_cycle` and `expectancy_blocked:score_floor_breach` implies over-constraining the system.",
      "why_it_happens": "The configured limits for new positions and minimum score thresholds are too restrictive, preventing the system from capitalizing on valid trading opportunities, as evidenced by the high blocked trade counts.",
      "recommended_fix": "Review and recalibrate the 'max_new_positions_per_cycle' and 'expectancy_blocked:score_floor_breach' constraints. Implement a dynamic adjustment mechanism based on market volatility or system performance. Owner: Risk/CRO.",
      "expected_impact": "Unlock suppressed edge, potentially realizing a significant portion of the $18590.23 in blocked opportunity cost, leading to a direct increase in P&L by up to $500-$1000 per day."
    },
    {
      "subsystem": "Correlation",
      "issue": "Missing correlation cache is preventing proper risk assessment and potentially leading to unmanaged concentration risk.",
      "why_it_happens": "The script to generate the correlation cache (`compute_signal_correlation_snapshot.py`) is not being run regularly or is failing, leaving a critical gap in risk management data.",
      "recommended_fix": "Automate the daily generation of the correlation cache and integrate it into the EOD bundle. Owner: CTO/SRE.",
      "expected_impact": "Enable accurate quantification and management of correlation concentration risk, preventing potential clustered losses and improving overall portfolio risk-adjusted returns by 1-2%."
    },
    {
      "subsystem": "Signal Effectiveness",
      "issue": "Despite tightened FIRE SALE exits, signal decay remains a primary exit reason, implying entry signals might be too weak or short-lived.",
      "why_it_happens": "Entry signals may have insufficient edge, or their predictive power decays too rapidly, leading to positions being closed at a loss despite attempts to cut them quickly. The `UW root cause` shows `quality_score=0.0` and `edge_suppression=0.98` for candidates, indicating weak entry quality.",
      "recommended_fix": "Conduct a deeper analysis of entry signal quality and decay rates. Explore incorporating additional filters or a more dynamic entry sizing mechanism based on projected signal longevity. Owner: Head of Trading.",
      "expected_impact": "Improve the average quality of entered trades, reducing the frequency and magnitude of losses due to signal decay, and potentially improving the overall win rate by 2-3%."
    }
  ],
  "root_cause": {
    "uw": "UW candidates show `quality_score=0.0` and `edge_suppression=0.98`, indicating that the underlying signals used for underwriting new positions are extremely weak and suppressed, leading to poor entry selection. While there are 50 candidates, their quality is insufficient to translate into realized edge (edge_realization=0.4).",
    "exits": "Exit causality is overwhelmingly dominated by 'unknown' reasons (2078 counts) and various forms of 'signal_decay' across different thresholds. This signifies that positions are being closed either without proper tracking or due to signals weakening too rapidly. The tightened FIRE SALE exit regime has not yet mitigated this sufficiently, suggesting that entries themselves may be problematic.",
    "constraints": "Constraint root cause shows `suppression_cost_usd=18590.23`, primarily driven by `max_new_positions_per_cycle` (1041 blocked) and `expectancy_blocked:score_floor_breach` (357 blocked). This indicates that the system is being over-constrained, preventing it from taking potentially profitable trades and suppressing realized edge.",
    "survivorship": "While not directly causing losses today, the survivorship framework (penalize_strong / boost_strong) applies score adjustments. If `penalize_strong` is being triggered frequently, it indicates that losing symbols are consistently underperforming, and the score penalty might not be sufficient to deter repeated bad trades. No symbol bans are in place, which could allow persistent losers to continue generating signals.",
    "correlation": "The `Correlation Concentration Watchlist` and `missed_money_numeric`'s `correlation_score=5.8284` indicate that correlation concentration is a significant, unmanaged risk. The explicit warning about a 'missing correlation cache' is the root cause, preventing the system from identifying and mitigating clustered exposures effectively, which can lead to magnified losses."
  },
  "recommended_fixes": [
    {
      "fix": "Automate the generation and integration of the correlation cache into the EOD bundle.",
      "subsystem": "Correlation",
      "expected_impact": "Enable accurate assessment and management of portfolio-wide correlation risk, reducing potential clustered losses and improving risk-adjusted returns by 1-2%.",
      "test_plan": "Verify the presence of 'wheel_watchlists.correlation_concentration' in the next 3 EOD reviews, with updated correlation metrics and mitigation considerations."
    },
    {
      "fix": "Implement a clear, automated workflow for Board action closure, including ownership and verification.",
      "subsystem": "Governance",
      "expected_impact": "Unblock all other system improvements, significantly accelerating the rollout of profitability-enhancing features and increasing overall operational efficiency.",
      "test_plan": "Confirm 'Board action closure' status changes to PASS in the next EOD review. Track completion rate of proposed actions over the next 5 days."
    },
    {
      "fix": "Calibrate 'max_new_positions_per_cycle' and 'expectancy_blocked:score_floor_breach' constraints.",
      "subsystem": "Constraints",
      "expected_impact": "Unlock suppressed edge, potentially realizing $500-$1000 daily in additional P&L by allowing more profitable trades to execute.",
      "test_plan": "Monitor 'blocked_trade_counts_by_window' for a reduction in blocks due to these reasons and observe a corresponding increase in `total_pnl_usd` over the next 3-5 days."
    },
    {
      "fix": "Enhance attribution logging to eliminate 'unknown' exit reasons.",
      "subsystem": "Exits",
      "expected_impact": "Improve the clarity and actionable insights from exit analysis, allowing for targeted improvements to exit strategies and reducing untraced P&L degradation by 2-5%.",
      "test_plan": "Observe a significant reduction (e.g., <100) in 'unknown' exit reasons in `attribution.jsonl` and `exit_attribution.jsonl` within 5 days."
    },
    {
      "fix": "Conduct a deep dive into entry signal quality and decay characteristics.",
      "subsystem": "Signal Effectiveness",
      "expected_impact": "Improve the quality of entered trades, reducing the frequency and magnitude of losses due to rapid signal decay, potentially increasing the overall win rate by 2-3%.",
      "test_plan": "Analyze entry signal performance in a test variant; track average P&L per trade and signal decay rates. Look for an improvement in the win rate for these trades over 7 days."
    }
  ],
  "rollback_decision": {
    "triggered": false,
    "reason": "",
    "canary_disabled": false,
    "pnl_1d": -162.15,
    "win_rate_1d": 0.1516
  }
}